-- liquibase formatted sql

--changeset nkoechnev:create-deafult-team
INSERT INTO teams (name, team_type) VALUES ('ВТБ', 'COMPANY');
--rollback DELETE FROM teams WHERE name = 'ВТБ'

--changeset nkoechnev:seed-actions
INSERT INTO actions (name, coins, operation_type, created_by, updated_date, updated_by, visible) VALUES
('Прохождение блока внутренних курсов', 2, 'INCREASE', '00000000-0000-0000-0000-000000000000', now(), '00000000-0000-0000-0000-000000000000', true),
('Подготовить доклад на внутренний митап', 4, 'INCREASE', '00000000-0000-0000-0000-000000000000', now(), '00000000-0000-0000-0000-000000000000', true),
('Подготовить статью на Habr', 4, 'INCREASE', '00000000-0000-0000-0000-000000000000', now(), '00000000-0000-0000-0000-000000000000', true),
('Участие в IT подкасте ', 6, 'INCREASE', '00000000-0000-0000-0000-000000000000', now(), '00000000-0000-0000-0000-000000000000', true),
('Принятое улучшение процессов компании', 10, 'INCREASE', '00000000-0000-0000-0000-000000000000', now(), '00000000-0000-0000-0000-000000000000', true),
('Участие в профильной конференции', 12, 'INCREASE', '00000000-0000-0000-0000-000000000000', now(), '00000000-0000-0000-0000-000000000000', true),
('Начисление администратором', 10   , 'INCREASE', '00000000-0000-0000-0000-000000000000', now(), '00000000-0000-0000-0000-000000000000', false)
--rollback DELETE FROM actions WHERE created_by = '00000000-0000-0000-0000-000000000000';